app/Http/Controllers/ReviewController.php

    public function index()
    {
        $reviews = Review::all(); // Ambil semua review dari database
---
select * from `reviews`

    public function store(Request $request)
    {
        $request->validate([
            'rating' => 'required|integer',
            'review' => 'required|string',
            'events_id' => 'required|integer', // tambahkan validasi untuk events_id
        ]);

        $review = new Review;
        $review->rating = $request->input('rating');
        $review->review = $request->input('review');
        $review->user_id = auth()->id(); // mengasumsikan Anda menggunakan autentikasi bawaan Laravel
        $review->events_id = $request->input('events_id'); // tambahkan events_id

        $review->save();
---
insert into `reviews` (`rating`, `review`, `user_id`, `events_id`, `updated_at`, `created_at`) values ('5', 'bagus bangttt', 1, '7215138', '2024-07-15 09:27:24', '2024-07-15 09:27:24')

    public function show($id)
    {
        $review = Review::findOrFail($id);
---
select * from `reviews` where `reviews`.`id` = '1' limit 1

    public function destroy(Review $review)
    {
        // Hapus review dari database
        $review->delete();
---
delete from `reviews` where `id` = 1