app/Http/Controllers/TiketController.php

    public function index()
    {
        $tikets = Tiket::all();
---
select * from `tikets`

    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'nama_pembeli' => 'required|string',
            'kategori_tiket' => 'required|string',
            'jumlah' => 'required|integer',
            'tanggal' => 'required|string',
        ]);

        // Simpan data ke dalam database
        $tiket = new Tiket();
        $tiket->nama_pembeli = $request->nama_pembeli;
        $tiket->kategori_tiket = $request->kategori_tiket;
        $tiket->jumlah = $request->jumlah;
        $tiket->tanggal = $request->tanggal;
        $tiket->save();
---
insert into `tikets` (`nama_pembeli`, `kategori_tiket`, `jumlah`, `tanggal`, `updated_at`, `created_at`) values ('Mega Nopiyanti', 'PAYUN - PRESALE 2 IDR Rp.175.000', '3', '12-02-2004', '2024-07-15 06:26:50', '2024-07-15 06:26:50')

    public function show(string $id)
    {
        $tiket = Tiket::findOrFail($id);
---
select * from `tikets` where `tikets`.`id` = '6' limit 1

    public function edit(string $id)
    {
        $tiket = Tiket::findOrFail($id);
---
select * from `tikets` where `tikets`.`id` = '2' limit 1

    public function update(Request $request, string $id)
    {
        $request->validate([
            'nama_pembeli' => 'required|string|max:100',
            'kategori_tiket' => 'required|string',
            'jumlah' => 'required|integer',
            'tanggal' => 'required|string',
        ]);

        $tiket = Tiket::findOrFail($id);
        $tiket->update($request->all());
---
update `tikets` set `tanggal` = '12-02-2024', `tikets`.`updated_at` = '2024-07-15 06:27:29' where `id` = 27

    public function destroy(string $id)
    {
        $tiket = Tiket::findOrFail($id);
        $tiket->delete();
---
select * from `tikets` where `tikets`.`id` = '1' limit 1
delete from `tikets` where `id` = 1